# Это было базовое введение в работу с терминалом.
# Всего в Linux команд гораздо больше, чем здесь описано.

# После изучения данного материала у вас будет общее понимание,
# как выполнять несложные операции.

# Всему сразу не научишься. Важно сталкиваться с практическими задачами.
# Главное — научиться искать информацию, которая поможет выполнить
# поставленные перед вами задачи.


# Бонус:
# В терминале есть важные сочетания клавиш, которые сильно упрощают работу.
# Вот несколько необходимых:

# Tab — автодополнение команд, имен файлов или директорий.
# Нажмите Tab один раз, чтобы дополнить ввод.
# Если вариантов несколько, дважды нажмите Tab, чтобы увидеть список.

# Ctrl+Z — приостанавливает выполнение команды.
# Команда не завершится, а перейдёт в фоновый режим.
# Вернуть её можно с помощью команды fg.

# Ctrl+C — прерывает выполнение команды.
# Используется, если команда зависла или нужно её срочно остановить.

# Ctrl+W — удаляет последнее слово перед курсором.
# Очень полезно для быстрого редактирования команд.

# Ctrl+K — удаляет весь текст после курсора.
# Используется для очистки лишнего текста в строке.

# стрелки "вверх" и "вниз" 
# перемещают по истории исопльзованных команд, для повторного использования

# Ctrl+R — запускает поиск по истории команд.
# Начните вводить часть команды, и терминал найдёт подходящую.
# Нажмите Enter, чтобы выполнить найденное, или Esc для выхода из поиска.
