# Используя компьютер, вы, вероятно, привыкли скачивать программы,
# заходя на сайт программы и нажимая кнопку "Скачать".
# В Linux чаще всего эти действия вы будете выполнять
# с помощью пакетных менеджеров.
# Если у вас стоит Ubuntu, там обычно предустановлен пакетный менеджер apt.
# Если у вас macOS, вам нужно скачать brew (Homebrew).
# Если у вас другой дистрибутив, самостоятельно узнайте, какой пакетный менеджер установлен у вас.

# Теперь попробуйте скачать пакет:
apt install git  # для Ubuntu
brew install git  # для macOS

# Таким образом, вы скачаете git.
# Git — это отраслевой стандарт программы для управления версиями кода.
# Сейчас вы проходите уроки на GitHub. Это одно из трёх крупнейших хранилищ Git-репозиториев.
# Подробнее о Git вы узнаете и научитесь им пользоваться в следующих разделах.